package by.epam.module04.task4101;

public class InputTextData {
    public String enterText(){
        return "Храбрый ёж\n" +
                "Был    в ле-су ста_рый пень. Тут — в дупле ёж сделал гнездо. В гнездо он натаскал травы." +
                " Стало тепло и мягко. Днем ёж спал, а вечером выходил на охоту...\n" +
                "Вот наступил вечер. Еж проснулся и пошёл искать пищу. Не нашёл ничего и идёт домой. " +
                "Вдруг он увидел змею. Ёж бросился на неё. Змея зашипела и бросилась на ежа. Ёж не боится змей.";
    }

}
